files/obtenerArticulos.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ObtenerArticulos xmlns="http://plataforma.net.ar/">
            <AtributosVisibles>
                <ArticuloAtributos>ArticuloID</ArticuloAtributos>
                <ArticuloAtributos>Nombre</ArticuloAtributos>
                <ArticuloAtributos>ArticuloEmpresa</ArticuloAtributos>
                <ArticuloAtributos>ArticuloParaImpresion</ArticuloAtributos>
                <ArticuloAtributos>TipoDeArticulo</ArticuloAtributos>
                <ArticuloAtributos>Descripcion</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion1Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion2Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion3Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion4Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion5Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion6Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion7Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion8Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion9Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion10Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion11Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion12Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion13Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion14Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion15Articulos</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion16Articulos</ArticuloAtributos>
                <ArticuloAtributos>UnidadDeMedidaDeStock</ArticuloAtributos>
                <ArticuloAtributos>CodigoDeBarraPorUnidadDeMedidaDeStock</ArticuloAtributos>
                <ArticuloAtributos>SeControlaStock</ArticuloAtributos>
                <ArticuloAtributos>SeAdministraConPartidas</ArticuloAtributos>
                <ArticuloAtributos>SeAdministraConNumerosDeSerie</ArticuloAtributos>
                <ArticuloAtributos>SeAdministraPorTalles</ArticuloAtributos>
                <ArticuloAtributos>SeVende</ArticuloAtributos>
                <ArticuloAtributos>SeCompra</ArticuloAtributos>
                <ArticuloAtributos>FechaDeAlta</ArticuloAtributos>
                <ArticuloAtributos>FechaDeBaja</ArticuloAtributos>
                <ArticuloAtributos>BloqueadoParaMovimientosDeStock</ArticuloAtributos>
                <ArticuloAtributos>PesoEmbaladoPorUnidadDeMedidaDeStock</ArticuloAtributos>
                <ArticuloAtributos>CantidadPorUnidadDeMedidaDeStockPorBulto</ArticuloAtributos>
                <ArticuloAtributos>UnidadDeMedidaHomogeneaDeStock</ArticuloAtributos>
                <ArticuloAtributos>FactorDeConversionUnidadDeMedidaHomogeneaDeStock</ArticuloAtributos>
                <ArticuloAtributos>CuentaDeActivo</ArticuloAtributos>
                <ArticuloAtributos>SeProduce</ArticuloAtributos>
                <ArticuloAtributos>ModoDeConsumoDeComponentes</ArticuloAtributos>
                <ArticuloAtributos>ModalidadDeStockMinimo</ArticuloAtributos>
                <ArticuloAtributos>StockMinimoParaModalidadPorCantidadFija</ArticuloAtributos>
                <ArticuloAtributos>GeneraMovimientosDeStock</ArticuloAtributos>
                <ArticuloAtributos>ClasificadorVariablePorUnidadDeMedidaDeArticulo</ArticuloAtributos>
                <ArticuloAtributos>PorcentajeDeDesvioMaximoParaAjusteManualDeConsAutoDeOF</ArticuloAtributos>
                <ArticuloAtributos>AdministraPrecioPromedioPonderado</ArticuloAtributos>
                <ArticuloAtributos>AjustaCantidadesEnUMDeStockCalculadasPorElSistema</ArticuloAtributos>
                <ArticuloAtributos>PorcentajeMaximoDeAjusteDeCantidadEnUMDeStock</ArticuloAtributos>
                <ArticuloAtributos>SeCosteaPorCierreMensual</ArticuloAtributos>
                <ArticuloAtributos>Talle</ArticuloAtributos>
                <ArticuloAtributos>Color</ArticuloAtributos>
                <ArticuloAtributos>DivisionParaAsientoDeCosteoPorCierre</ArticuloAtributos>
                <ArticuloAtributos>EspecieDeGranoONCCA</ArticuloAtributos>
                <ArticuloAtributos>TipoDeGranoONCCA</ArticuloAtributos>
                <ArticuloAtributos>VariedadDeGrano</ArticuloAtributos>
                <ArticuloAtributos>CuentaDeAnticipoLiquidacionCompraCereal</ArticuloAtributos>
                <ArticuloAtributos>CodigoDeProductoCOT</ArticuloAtributos>
                <ArticuloAtributos>UnidadDeMedidaCOT</ArticuloAtributos>
                <ArticuloAtributos>FactorDeConversionCOT</ArticuloAtributos>
                <ArticuloAtributos>VolumenEmbaladoPorUnidadDeMedidaDeStock</ArticuloAtributos>
                <ArticuloAtributos>UnidadDeMedidaParaDimensionesDelArticulo</ArticuloAtributos>
                <ArticuloAtributos>Largo</ArticuloAtributos>
                <ArticuloAtributos>Ancho</ArticuloAtributos>
                <ArticuloAtributos>Alto</ArticuloAtributos>
                <ArticuloAtributos>BloqueadoParaVenta</ArticuloAtributos>
                <ArticuloAtributos>FechaDeBajaParaVentas</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion1ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion2ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion3ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion4ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion5ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion6ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion7ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion8ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion9ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion10ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion11ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion12ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion13ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion14ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion15ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>Clasificacion16ArticulosNombre</ArticuloAtributos>
                <ArticuloAtributos>UnidadDeMedidaDeStockNombre</ArticuloAtributos>
                <ArticuloAtributos>UnidadDeMedidaHomogeneaDeStockNombre</ArticuloAtributos>
                <ArticuloAtributos>ClasificadorVariablePorUnidadDeMedidaDeArticuloNombre</ArticuloAtributos>
                <ArticuloAtributos>TalleNombre</ArticuloAtributos>
                <ArticuloAtributos>ColorNombre</ArticuloAtributos>
                <ArticuloAtributos>CuentaDeAnticipoLiquidacionCompraCerealNombre</ArticuloAtributos>
                <ArticuloAtributos>CodigoDeProductoCOTNombre</ArticuloAtributos>
                <ArticuloAtributos>UnidadDeMedidaParaDimensionesDelArticuloNombre</ArticuloAtributos>
                <ArticuloAtributos>FechaUltActualizacion</ArticuloAtributos>
                <ArticuloAtributos>FactorDeConversionUMHomVen</ArticuloAtributos>
            </AtributosVisibles>
            <Filtros></Filtros>
        </ObtenerArticulos>
    </soap:Body>
</soap:Envelope>